reference/c-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C/C++ notes</title>
<meta property="og:title" content="C/C++ notes" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">C/C++ notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#c-notes">2. C notes</a>
<ul>
<li><a href="#arrays">2.1. Arrays</a>
<ul>
<li><a href="#array-subscripting">2.1.1. Array subscripting</a></li>
<li><a href="#contiguous-elements-without-padding">2.1.2. Contiguous elements without padding</a></li>
</ul>
</li>
<li><a href="#structures">2.2. Structures</a>
<ul>
<li><a href="#order-of-structure-members">2.2.1. Order of structure members</a></li>
<li><a href="#end-padding-in-structures">2.2.2. End padding in structures</a></li>
<li><a href="#alignment-of-each-member">2.2.3. Alignment of each member</a></li>
<li><a href="#flexible-array-members">2.2.4. Flexible array members</a></li>
</ul>
</li>
<li><a href="#bit-fields">2.3. Bit-fields</a>
<ul>
<li><a href="#pointers-to-bit-field-objects">2.3.1. Pointers to bit-field objects</a></li>
<li><a href="#order-of-allocation-of-bit-fields">2.3.2. Order of allocation of bit-fields</a></li>
<li><a href="#unnamed-and-zero-width-bit-fields">2.3.3. Unnamed and zero width bit-fields</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
These are some C and C++ notes that I have considered important throughout the
years, although I will probably continue updating this list in the future. I
will try to store the source of each note,
</p>

<p>
Here are some related resources that you might find interesting:
</p>

<ul class="org-ul">
<li>C99 standard: <a href="https://www.iso-9899.info/n1256.html">https://www.iso-9899.info/n1256.html</a></li>
<li>Dennis Yurichev&rsquo;s C notes: <a href="https://yurichev.com/C-book.html">https://yurichev.com/C-book.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-c-notes" class="outline-2">
<h2 id="c-notes"><span class="section-number-2">2.</span> C notes</h2>
<div class="outline-text-2" id="text-c-notes">
</div>

<div id="outline-container-arrays" class="outline-3">
<h3 id="arrays"><span class="section-number-3">2.1.</span> Arrays</h3>
<div class="outline-text-3" id="text-arrays">
</div>

<div id="outline-container-array-subscripting" class="outline-4">
<h4 id="array-subscripting"><span class="section-number-4">2.1.1.</span> Array subscripting</h4>
<div class="outline-text-4" id="text-array-subscripting">
<p>
The definition of the subscript operator <code>[]</code> is that <code>E1[E2]</code> is identical to
<code>(*((E1)+(E2)))</code>. Because of the conversion rules that apply to the binary <code>+</code>
operator, if <code>E1</code> is an array object (equivalently, a pointer to the initial
element of an array object) and <code>E2</code> is an integer, <code>E1[E2]</code> designates the <code>E2</code>-th
element of <code>E1</code> (counting from zero)<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
</div>
</div>

<div id="outline-container-contiguous-elements-without-padding" class="outline-4">
<h4 id="contiguous-elements-without-padding"><span class="section-number-4">2.1.2.</span> Contiguous elements without padding</h4>
<div class="outline-text-4" id="text-contiguous-elements-without-padding">
<p>
Array elements have to be contiguous without padding between them<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
</div>
</div>
</div>

<div id="outline-container-structures" class="outline-3">
<h3 id="structures"><span class="section-number-3">2.2.</span> Structures</h3>
<div class="outline-text-3" id="text-structures">
<p>
See also <a href="#bit-fields">Bit-fields</a>.
</p>
</div>

<div id="outline-container-order-of-structure-members" class="outline-4">
<h4 id="order-of-structure-members"><span class="section-number-4">2.2.1.</span> Order of structure members</h4>
<div class="outline-text-4" id="text-order-of-structure-members">
<p>
The address of each structure member must increase in the order in which they
are declared. There may be unnamed padding <i>within</i> a structure object, but <i>not</i>
at its beginning<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>
</div>
</div>

<div id="outline-container-end-padding-in-structures" class="outline-4">
<h4 id="end-padding-in-structures"><span class="section-number-4">2.2.2.</span> End padding in structures</h4>
<div class="outline-text-4" id="text-end-padding-in-structures">
<p>
There may be unnamed padding at the end of a structure or union<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>. This is normally done to align the start address of a
potentially contiguous structure of the same type (e.g. when declaring arrays of
this structure); see <a href="#contiguous-elements-without-padding">Contiguous elements without padding</a>.
</p>
</div>
</div>

<div id="outline-container-alignment-of-each-member" class="outline-4">
<h4 id="alignment-of-each-member"><span class="section-number-4">2.2.3.</span> Alignment of each member</h4>
<div class="outline-text-4" id="text-alignment-of-each-member">
<p>
Each non-bit-field member of a structure or union object is aligned in an
implementation-defined manner appropriate to its type<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>.
</p>
</div>
</div>

<div id="outline-container-flexible-array-members" class="outline-4">
<h4 id="flexible-array-members"><span class="section-number-4">2.2.4.</span> Flexible array members</h4>
<div class="outline-text-4" id="text-flexible-array-members">
<p>
The last element of a structure with more than one named member may have an
incomplete array type; this is called a <i>flexible array member</i>. In most
situations, the flexible array member is ignored, but it can still be used to
access elements of an array of that specified type as if it was declared at that
offset in the structure<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>.
</p>

<p>
For example, after the declaration:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> {
    <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">n</span>;
    <span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">d</span>[]; <span style="color: #989898;">/* </span><span style="color: #989898;">Flexible array member</span><span style="color: #989898;"> */</span>
};
</pre>
</div>

<p>
The structure <code>Foo</code> has a flexible array member <code>d</code>. A typical way to use this is:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">m</span> = <span style="color: #989898;">/* </span><span style="color: #989898;">some value</span><span style="color: #989898;"> */</span>;
<span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span>* <span style="color: #6ae4b9;">p</span> = malloc(<span style="color: #ff6f9f;">sizeof</span>(<span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span>) + <span style="color: #ff6f9f;">sizeof</span>(<span style="color: #79a8ff;">double</span>[m]));
</pre>
</div>

<p>
And assuming that the call to <code>malloc</code> succeeds, the object pointed to by <code>p</code>
behaves, for most purposes, as if <code>p</code> had been declared as:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">struct</span> {
    <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">n</span>;
    <span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">d</span>[m];
}* <span style="color: #6ae4b9;">p</span>;
</pre>
</div>

<p>
There are circumstances in which this equivalence is broken; in particular, the
offsets of member <code>d</code> might not be the same.
</p>
</div>
</div>
</div>

<div id="outline-container-bit-fields" class="outline-3">
<h3 id="bit-fields"><span class="section-number-3">2.3.</span> Bit-fields</h3>
<div class="outline-text-3" id="text-bit-fields">
<p>
See also <a href="#structures">Structures</a>.
</p>
</div>

<div id="outline-container-pointers-to-bit-field-objects" class="outline-4">
<h4 id="pointers-to-bit-field-objects"><span class="section-number-4">2.3.1.</span> Pointers to bit-field objects</h4>
<div class="outline-text-4" id="text-pointers-to-bit-field-objects">
<p>
The unary <code>&amp;</code> (<i>address-of</i>) operator cannot be applied to a bit-field object;
thus, there are no pointers to or arrays of bit-field objects<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>.
</p>
</div>
</div>

<div id="outline-container-order-of-allocation-of-bit-fields" class="outline-4">
<h4 id="order-of-allocation-of-bit-fields"><span class="section-number-4">2.3.2.</span> Order of allocation of bit-fields</h4>
<div class="outline-text-4" id="text-order-of-allocation-of-bit-fields">
<p>
The order of allocation of bit-fields within a unit (<a href="https://en.wikipedia.org/wiki/Bit_numbering">high-order to low-order</a> or
low-order to high-order) is implementation-defined<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>. Therefore, in the following example:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> {
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">a</span> : <span style="color: #88ca9f;">3</span>;
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">b</span> : <span style="color: #88ca9f;">11</span>;
};

<span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> <span style="color: #6ae4b9;">foo</span>;
foo.a = <span style="color: #88ca9f;">0</span>;     <span style="color: #989898;">/* </span><span style="color: #989898;">Unnecessary</span><span style="color: #989898;"> */</span>
foo.b = <span style="color: #88ca9f;">0x7FF</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">0b11111111111</span><span style="color: #989898;"> */</span>
</pre>
</div>

<p>
The layout of the <code>foo</code> variable might be any of the following (assuming the
integer is stored in <a href="https://en.wikipedia.org/wiki/Endianness">big-endian</a> format):
</p>

<pre class="example" id="example1">
| Binary                             |        Hex |   Decimal |
|------------------------------------+------------+-----------|
| 0b00011111111111000000000000000000 | 0x1FFC0000 | 536608768 |
| 0b00000000000000000011111111111000 |     0x3FF8 |     16376 |
</pre>
</div>
</div>

<div id="outline-container-unnamed-and-zero-width-bit-fields" class="outline-4">
<h4 id="unnamed-and-zero-width-bit-fields"><span class="section-number-4">2.3.3.</span> Unnamed and zero width bit-fields</h4>
<div class="outline-text-4" id="text-unnamed-and-zero-width-bit-fields">
<p>
A bit-field declaration with no declarator, but only a colon and a width,
indicates an unnamed bit-field<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>. Therefore, in
the following example:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> {
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">a</span> : <span style="color: #88ca9f;">3</span>;
    <span style="color: #88ca9f;">uint32_t</span>   : <span style="color: #88ca9f;">6</span>;
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">b</span> : <span style="color: #88ca9f;">11</span>;
};

<span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> <span style="color: #6ae4b9;">foo</span>;
foo.a = <span style="color: #88ca9f;">0x7</span>;   <span style="color: #989898;">/* </span><span style="color: #989898;">0b00000000111</span><span style="color: #989898;"> */</span>
foo.b = <span style="color: #88ca9f;">0x7FF</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">0b11111111111</span><span style="color: #989898;"> */</span>
</pre>
</div>

<p>
The layout of the <code>foo</code> variable would be the following (assuming the integer is
stored in big-endian format, and that the bit-fields are <a href="#order-of-allocation-of-bit-fields">allocated low-order to
high-order</a>):
</p>

<pre class="example" id="example2">
| Binary                             |     Hex | Decimal |
|------------------------------------+---------+---------|
| 0b00000000000011111111111000000111 | 0xFFE07 | 1048071 |
</pre>

<p>
As a special case, an unnamed bit-field member with a width of 0 indicates that
no further bit-field is to be packed into the unit in which the previous
bit-field, if any, was placed. Therefore, in the following example:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> {
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">a</span> : <span style="color: #88ca9f;">3</span>;
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">b</span> : <span style="color: #88ca9f;">11</span>;
    <span style="color: #88ca9f;">uint32_t</span>   : <span style="color: #88ca9f;">0</span>;
    <span style="color: #79a8ff;">uint32_t</span> <span style="color: #6ae4b9;">c</span> : <span style="color: #88ca9f;">5</span>;
};

<span style="color: #ff6f9f;">struct</span> <span style="color: #79a8ff;">Foo</span> <span style="color: #6ae4b9;">foo</span>;
foo.a = <span style="color: #88ca9f;">0x7</span>;   <span style="color: #989898;">/* </span><span style="color: #989898;">0b00000000111</span><span style="color: #989898;"> */</span>
foo.b = <span style="color: #88ca9f;">0x7FF</span>; <span style="color: #989898;">/* </span><span style="color: #989898;">0b11111111111</span><span style="color: #989898;"> */</span>
foo.c = <span style="color: #88ca9f;">0x1F</span>;  <span style="color: #989898;">/* </span><span style="color: #989898;">0b00000011111</span><span style="color: #989898;"> */</span>
</pre>
</div>

<p>
The layout of the <code>foo</code> variable would be the following (again, assuming the
integers are stored in big-endian format, and that the bit-fields are allocated
low-order to high-order):
</p>

<pre class="example" id="example3">
.............................###................................ (foo.a)
..................###########................................... (foo.b)
...........................................................##### (foo.c)
^0      ^1      ^2      ^3      ^4      ^5      ^6      ^7       (byte number)

`------------------------------´`------------------------------´
           First unit                     Second unit
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99, 6.5.2.1, point 2; and 6.5.6,
point 8.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99,
6.5.6, points 8 and 9, and specially footnote 91.</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99, 6.7.2.1, point 13.</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99,
6.7.2.1, point 15.</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99, 6.7.2.1,
point 12; and C99, J.3.9, point 5.</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">This explanation is an oversimplification. See C99,
6.7.2.1, points 16 to 22.</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99,
6.7.2.1, footnote 106.</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99, 6.7.2.1, point
10.</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9" role="doc-backlink">9</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See C99, 6.7.2.1, point 11.</p></div></div>


</div>
</div></div>
</body>
</html>
